[
  {
    "year": "May 2024 - November 2024",
    "events": [
      {
        "icon": "work",
        "title": "The Penta Group - Media Monitoring Analyst Intern",
        "content": "Working as a Media Monitoring Analyst Intern I quickly mastered the company's systems and effectively communicated with clients and colleagues, demonstrating a strong ability to learn and adapt. By working closely with a diverse portfolio of clients, I identified business needs, delivered actionable media insights, and collaborated with the tech department to improve system efficiency."
      }
    ]
  },
  {
    "year": "December 2023",
    "events": [
      {
        "icon": "school",
        "title": "New Jersey City University",
        "content": "Graduated with Bachelors Degree in Computer Science"
      }
    ]
  },
  {
    "year": "August 2022- September 2023",
    "events": [
      {
        "icon": "work",
        "title": "Infosys",
        "content": "Develop and maintain custom data-centric web applications using ASP.NET, C#.NET and services with Agile/Scrum Methodology. Streamlined reporting processes by implementing business logic in C# .NET, integrating various data sources into a centralized data store, resulting in a weekly time savings of 10 hours on manual reporting tasks"
      }
    ]
  },
  {
    "year": "April 2022 - July 2022",
    "events": [
      {
        "icon": "work",
        "title": "Apprentice Now - Application Development - .NET Intensive",
        "content": "I successfully completed a 3-month 'Application Development - .NET Intensive' program, where I specialized in .NET technologies, with a primary focus on SQL Server. Proficient in C#, ASP.NET, and SQL Server, I gained hands-on experience in building robust and scalable applications within the .NET ecosystem. This intensive program has equipped me with the skills needed to excel in .NET application development, particularly with SQL Server as the database solution."
      }
    ]
  },
  {
    "year": "2020-2022",
    "events": [
      {
        "icon": "work",
        "title": "Goldman Sachs (Non tech)",
        "content": "Site Security Supervisor. Ensuring the safety and protection of the company's employees, visitors, and associated property. Provide coordination and supervision by monitoring surveillance equipment, verifying visitors, and maintaining consistent security protocols"
      }
    ]
  },
  {
    "year": "2019-2021",
    "events": [
      {
        "icon": "work",
        "title": "Brookestone (Non tech)",
        "content": "Operational Manager. Responsible for supervising, hiring, and training employees, Manage quality assurance programs, and strategize process improvements, Oversee financial elements in the business like operating budgets, and launching price promotions that could attract revenue"
      }
    ]
  },
  {
    "year": "May 2019",
    "events": [
      {
        "icon": "school",
        "title": "Hudson County Community College",
        "content": "Graduated with Associates Degree in Liberal Arts"
      }
    ]
  }
]